package com.guo.operator;

public class Demo06 {
    public static void main(String[] args) {
        /*
        A = 0011 1100
        B = 0000 1101

        A&B 0000 1100
        两个二进制数每一位进行比较，如果两个都为1，结果才为1，否则为0

        同或运算
        A|B 0011 1101
        两个二进制数每一位进行比较，如果两个都为0,结果为0，否则为1

        异或运算
        A^B 0011 0001
        两个二进制数每一位进行比较，如果两个相同则为0，不相同则为1

        取反运算
        ~B 1111 0010
        把1全部变成0，0全部变成1

        常见面试题：
        2*8怎么运算最快
        可以拆分为2*2*2*2

        <<  左移  等于把数字*2
        >>  右移  等于把数字/2
        效率极高！！！！！

        0000 0000      0
        0000 0001      1
        0000 0010      2
        0000 0011      3
        0000 1000      8
        0001 0000      16
         */
        System.out.println(2<<3);//16
    }
}
